TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ПараметрыСозданияНастроекУсиленногоКонтроля/гкс_ПараметрыСозданияНастроекУсиленногоКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ПараметрыСозданияНастроекУсиленногоКонтроля</name>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Базис</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоказателяМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоказателяМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВходногоКонтроля</name>
    <type>
      <types>EnumRef.гкс_ТипыУсиленногоКонтроляКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтклонятьКачество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыУсиленногоКонтроляКачества/гкс_ТипыУсиленногоКонтроляКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыУсиленногоКонтроляКачества</name>
  <enumValues>
    <name>КаждоеТС</name>
    <comment>Каждое транспортное средство</comment>
  </enumValues>
  <enumValues>
    <name>ПервоеТС</name>
    <comment>Первое транспортное средство</comment>
  </enumValues>
  <enumValues>
    <name>ГруппыТС</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ПараметрыСозданияНастроекУсиленногоКонтроля/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьДоступностьЭлементовФормы();	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаКлиенте
Процедура ПоказательПриИзменении(Элемент)
	Объект.ОтклонятьКачество = ОтклонятьКачествоПоказателя(Объект.Показатель);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыиФункции

&НаСервереБезКонтекста
Функция ОтклонятьКачествоПоказателя(Показатель)
	Возврат
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Показатель, "гкс_ПриОтклоненииОтНормыОтклонятьКачество");
КонецФункции

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы() 
	
	ГруппыТС = Объект.ТипВходногоКонтроля = 
		Перечисления.гкс_ТипыУсиленногоКонтроляКачества.ГруппыТС;
	Элементы.КоличествоТС.Видимость = ГруппыТС;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ТипВходногоКонтроляПриИзменении(Элемент)
	Если Объект.ТипВходногоКонтроля <> 
		ПредопределенноеЗначение("Перечисление.гкс_ТипыУсиленногоКонтроляКачества.ГруппыТС") Тогда
		Объект.КоличествоТС = 0;
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти
